module.exports = [   
    [
        [
            {
                "name": "此节段下道支撑采用钢支撑对撑，故应补充钢支撑的预加轴力表，预加值大小可取计算值的80%，并复核支护结构强度。",
				"img": null,
				"status":  {
                    "annotationList": [
                        {
                            "rotation": 0,
                            "markupType": "Rectangle",
                            "drawPoints": [
                              [
                                2436.5648812408976,
                                1301.991990947342
                              ],
                              [
                                2547.662479295018,
                                1231.393024696202
                              ]
                            ],
                            "strokeStyle": "rgba(208,2,27,1)",
                            "lineWidth": 3,
                            "fillStyle": "rgba(255,255,255,0)",
                            "bNeedHitByBbox": true,
                            "drawEnd": true,
                            "markupId": 1582520013579
                        }
                    ],
                    "state": {
                      "ver": 1,
                      "WorldScale": 0.0016835016835016834,
                      "ViewAngle": 0,
                      "ViewCenter": {
                        "x": 2286.0783241318495,
                        "y": 1274.4456920017483
                      },
                      "ZoomFactor": 1
                    }
                  }
            }, {
                "name": "回筑侧墙时，应考虑补充拆除第一道混凝土支撑的工序",
				"img": null,
				"status":  {
                    "annotationList": [
                        {
                            "rotation": 0,
                            "markupType": "Rectangle",
                            "drawPoints": [
                              [
                                2436.5832750022582,
                                1349.333852953515
                              ],
                              [
                                2542.117833711737,
                                1302.7655949556358
                              ]
                            ],
                            "strokeStyle": "rgba(208,2,27,1)",
                            "lineWidth": 3,
                            "fillStyle": "rgba(255,255,255,0)",
                            "bNeedHitByBbox": true,
                            "drawEnd": true,
                            "markupId": 1582520770729
                        }
                    ],
                    "state": {
                      "ver": 1,
                      "WorldScale": 0.0016835016835016834,
                      "ViewAngle": 0,
                      "ViewCenter": {
                        "x": 2286.0783241318495,
                        "y": 1274.4456920017483
                      },
                      "ZoomFactor": 1
                    }
                }
            }, {
                "name": "在横断面图中补充混凝土连系梁与道路中心线之间的间距",
				"img": null,
				"status":  {
                    "annotationList": [
                        {
                            "rotation": 0,
                            "markupType": "Arrow",
                            "drawPoints": [
                              [
                                2252.5376193870943,
                                1423.450246673984
                              ],
                              [
                                2247.3610736130095,
                                1390.6654567714438
                              ]
                            ],
                            "strokeStyle": "rgba(208,2,27,1)",
                            "lineWidth": 3,
                            "bNeedHitByBbox": false,
                            "drawEnd": true,
                            "markupId": 1582521088271
                        }
                    ],
                    "state": {
                      "ver": 1,
                      "WorldScale": 0.0016835016835016834,
                      "ViewAngle": 0,
                      "ViewCenter": {
                        "x": 2286.0783241318495,
                        "y": 1274.4456920017483
                      },
                      "ZoomFactor": 1
                    }
                }
            }
        ], [
            {
                "name": "在横断面图中补充混凝土连系梁与道路中心线之间的间距",
				"img": null,
				"status":  {
                    "annotationList": [
                        {
                            "rotation": 0,
                            "markupType": "Arrow",
                            "drawPoints": [
                              [
                                2332.459941889161,
                                960.8162225383822
                              ],
                              [
                                2326.7704443101397,
                                930.9463602485188
                              ]
                            ],
                            "strokeStyle": "rgba(208,2,27,1)",
                            "lineWidth": 3,
                            "bNeedHitByBbox": false,
                            "drawEnd": true,
                            "markupId": 1582521237766
                        }
                    ],
                    "state": {
						"ver": 1,
						"WorldScale": 0.001122334455667789,
						"ViewAngle": 0,
						"ViewCenter": {
						  "x": 2434.5783241318495,
						  "y": 774.4456920017483
						},
						"ZoomFactor": 1
					}
                }
            }, {
                "name": "建议在构造详图中注明插筋长度",
				"img": null,
				"status":  {
                    "annotationList": [
                        {
                            "rotation": 0,
                            "markupType": "CloudRect",
                            "drawPoints": [
                              [
                                2629.300049864363,
                                736.1256422704417
                              ],
                              [
                                2729.174438616105,
                                676.1488552915889
                              ]
                            ],
                            "strokeStyle": "rgba(208,2,27,1)",
                            "lineWidth": 3,
                            "fillStyle": "rgba(255,255,255,0)",
                            "baseUnit": "30",
                            "bNeedHitByBbox": true,
                            "drawEnd": true,
                            "markupId": 1582521337374
                        }
                    ],
                    "state": {
						"ver": 1,
						"WorldScale": 0.001122334455667789,
						"ViewAngle": 0,
						"ViewCenter": {
						  "x": 2434.5783241318495,
						  "y": 774.4456920017483
						},
						"ZoomFactor": 1
					}
                }
            },{
                "name": "部分基坑坑底位于淤泥质粉质黏土层中，考虑到基坑环境保护等级较高，建议增加坑底裙边加固",
				"img": null,
				"status":  {
                    "annotationList": [
                        {
                            "rotation": 0,
                            "markupType": "Ellipse",
                            "drawPoints": [
                              [
                                2046.866456483096,
                                873.5660056144477
                              ],
                              [
                                2105.9165449926372,
                                824.2139243418748
                              ]
                            ],
                            "strokeStyle": "rgba(208,2,27,1)",
                            "lineWidth": 3,
                            "fillStyle": "rgba(255,255,255,0)",
                            "bNeedHitByBbox": true,
                            "drawEnd": true,
                            "markupId": 1582521594808,
                            "originPoints": [
                              [
                                2046.8664564830958,
                                892.0999750006542
                              ],
                              [
                                2105.9165449926372,
                                824.2139243418748
                              ]
                            ],
                            "originRotation": 0
                        }
                    ],
                    "state": {
						"ver": 1,
						"WorldScale": 0.001122334455667789,
						"ViewAngle": 0,
						"ViewCenter": {
						  "x": 2434.5783241318495,
						  "y": 774.4456920017483
						},
						"ZoomFactor": 1
					}
                }
            }
        ]
    ],[
        [
            {
                "name": "根据施工图设计原则，立柱桩混凝土设计强度等级应取C35",
				"img": null,
				"status":  {
                    "annotationList": [
                        {
                            "rotation": 0,
                            "markupType": "Rectangle",
                            "drawPoints": [
                              [
                                1855.1619045709206,
                                1115.4560955379404
                              ],
                              [
                                2009.9826298105086,
                                1098.9213131557074
                              ]
                            ],
                            "strokeStyle": "rgba(208,2,27,1)",
                            "lineWidth": 3,
                            "fillStyle": "rgba(255,255,255,0)",
                            "bNeedHitByBbox": true,
                            "drawEnd": true,
                            "markupId": 1582521936920,
                            "originPoints": [
                              [
                                1855.1619045709203,
                                1115.4560955379402
                              ],
                              [
                                2009.9826298105086,
                                1105.631585621205
                              ]
                            ],
                            "originRotation": 0
                        }
                    ],
                    "state": {
						"ver": 1,
						"WorldScale": 0.0016835016835016834,
						"ViewAngle": 0,
						"ViewCenter": {
						  "x": 2120.1520452551376,
						  "y": 1246.9247628052362
						},
						"ZoomFactor": 1
                    }
                  }
            }, {
                "name": "工程未包含35m有效桩长的规格，需复核",
				"img": null,
				"status":  {
                    "annotationList": [
                        {
                            "rotation": 0,
                            "markupType": "Ellipse",
                            "drawPoints": [
                              [
                                2164.41024870574,
                                1445.666692262405
                              ],
                              [
                                2315.051089111361,
                                1380.248956787454
                              ]
                            ],
                            "strokeStyle": "rgba(208,2,27,1)",
                            "lineWidth": 3,
                            "fillStyle": "rgba(255,255,255,0)",
                            "bNeedHitByBbox": true,
                            "drawEnd": true,
                            "markupId": 1582522082022,
                            "originPoints": [
                              [
                                2164.41024870574,
                                1445.6666922624047
                              ],
                              [
                                2315.051089111361,
                                1382.6496076305712
                              ]
                            ],
                            "originRotation": 0
                        }
                    ],
                    "state": {
						"ver": 1,
						"WorldScale": 0.0016835016835016834,
						"ViewAngle": 0,
						"ViewCenter": {
						  "x": 2120.1520452551376,
						  "y": 1246.9247628052362
						},
						"ZoomFactor": 1
                    }
                }
            }
        ],[
            {
                "name": "650型钢水泥土搅拌墙的围檩宽度建议为1000mm",
				"img": null,
				"status":  {
                    "annotationList": [
                        {
                            "rotation": 0,
                            "markupType": "CloudRect",
                            "drawPoints": [
                              [
                                1902.2047606254778,
                                987.1354397952238
                              ],
                              [
                                2030.9193915828716,
                                815.7892113232788
                              ]
                            ],
                            "strokeStyle": "rgba(208,2,27,1)",
                            "lineWidth": 3,
                            "fillStyle": "rgba(255,255,255,0)",
                            "baseUnit": "30",
                            "bNeedHitByBbox": true,
                            "drawEnd": true,
                            "markupId": 1582522366454
                        }
                    ],
                    "state": {
						"ver": 1,
						"WorldScale": 0.0016835016835016834,
						"ViewAngle": 0,
						"ViewCenter": {
						  "x": 2120.1520452551376,
						  "y": 796.9247628052362
						},
						"ZoomFactor": 1
                    }
                  }
            }, {
                "name": "型钢规格应为HM800×300×14×26",
				"img": null,
				"status":  {
                    "annotationList": [
                        {
                            "rotation": 0,
                            "markupType": "Ellipse",
                            "drawPoints": [
                              [
                                2217.7225935818756,
                                691.2562660252768
                              ],
                              [
                                2268.295905395401,
                                678.4548964724781
                              ]
                            ],
                            "strokeStyle": "rgba(208,2,27,1)",
                            "lineWidth": 3,
                            "fillStyle": "rgba(255,255,255,0)",
                            "bNeedHitByBbox": true,
                            "drawEnd": true,
                            "markupId": 1582523382569
                        }
                    ],
                    "state": {
						"ver": 1,
						"WorldScale": 0.0016835016835016834,
						"ViewAngle": 0,
						"ViewCenter": {
						  "x": 2120.1520452551376,
						  "y": 796.9247628052362
						},
						"ZoomFactor": 1
                    }
                  }
            }
        ],[
            {
				"name": "围檩的配箍方式错误，应采用“大箍套小箍”的方式保证满足抗扭构造要求",
				"img": null,
                "status":  {
                    "annotationList": [
                        {
                            "rotation": 0,
                            "fillStyle": "rgba(255,255,255,0)",
                            "close": true,
                            "markupType": "Cloud",
                            "drawPoints": [
                              [
                                1871.420080758813,
                                543.3793799971419
                              ],
                              [
                                1884.362630974051,
                                541.5982951051366
                              ],
                              [
                                1889.3496686716658,
                                529.9618738107022
                              ],
                              [
                                1884.4813699668512,
                                514.8820217250576
                              ],
                              [
                                1869.6389958668074,
                                511.7948079122484
                              ],
                              [
                                1858.9524865147757,
                                518.9191474802695
                              ],
                              [
                                1855.271577737965,
                                532.4553926595096
                              ],
                              [
                                1863.82078521959,
                                540.8858611483345
                              ],
                              [
                                1871.420080758813,
                                543.3793799971419
                              ]
                            ],
                            "strokeStyle": "rgba(208,2,27,1)",
                            "lineWidth": 3,
                            "controlPt": [
                              [
                                1878.960006801635,
                                550.2543676802823
                              ],
                              [
                                1893.8380025995189,
                                538.7723070764882
                              ],
                              [
                                1895.9634305706452,
                                519.5009685449913
                              ],
                              [
                                1878.9125112045147,
                                504.4329903586267
                              ],
                              [
                                1860.0211374499788,
                                508.9450720850402
                              ],
                              [
                                1848.9902850188262,
                                523.4787248038031
                              ],
                              [
                                1854.4879003854826,
                                541.8001513928973
                              ],
                              [
                                1866.1243216799169,
                                546.6921978962718
                              ]
                            ],
                            "editPt": null,
                            "bNeedHitByBbox": true,
                            "drawEnd": true,
                            "markupId": 1582524080904,
                            "originPoints": [
                              [
                                1867.320888690106,
                                536.820672687211
                              ],
                              [
                                1880.2634389053442,
                                535.0395877952056
                              ],
                              [
                                1885.2504766029588,
                                523.4031665007712
                              ],
                              [
                                1880.3821778981444,
                                508.3233144151266
                              ],
                              [
                                1865.5398037981006,
                                505.2361006023175
                              ],
                              [
                                1854.853294446069,
                                512.3604401703386
                              ],
                              [
                                1851.1723856692581,
                                525.8966853495787
                              ],
                              [
                                1859.7215931508833,
                                534.3271538384035
                              ],
                              [
                                1867.320888690106,
                                536.820672687211
                              ]
                            ],
                            "originRotation": 0,
                            "originControlPt": [
                              [
                                1874.8608147329282,
                                543.6956603703513
                              ],
                              [
                                1889.738810530812,
                                532.2135997665573
                              ],
                              [
                                1891.8642385019384,
                                512.9422612350604
                              ],
                              [
                                1874.813319135808,
                                497.87428304869576
                              ],
                              [
                                1855.921945381272,
                                502.3863647751092
                              ],
                              [
                                1844.8910929501194,
                                516.920017493872
                              ],
                              [
                                1850.3887083167758,
                                535.2414440829664
                              ],
                              [
                                1862.02512961121,
                                540.1334905863409
                              ]
                            ]
                        }
                    ],
                    "state": {
						"ver": 1,
						"WorldScale": 0.0016835016835016834,
						"ViewAngle": 0,
						"ViewCenter": {
						  "x": 2120.1520452551376,
						  "y": 346.92476280523624
						},
						"ZoomFactor": 1
                    }
                  }
            }, {
				"name": "描述：腋角加强筋的弯钩段长度取15d即可。",
				"img": null,
                "status":  {
                    "annotationList": [
                        {
                            "rotation": 0,
                            "fillStyle": "rgba(255,255,255,0)",
                            "close": true,
                            "markupType": "Cloud",
                            "drawPoints": [
                              [
                                2184.701402521588,
                                393.70520209451473
                              ],
                              [
                                2203.46008489324,
                                388.9455364181254
                              ],
                              [
                                2217.1791212545977,
                                362.6273850310316
                              ],
                              [
                                2213.539376913829,
                                333.50943030488526
                              ],
                              [
                                2183.5814811859673,
                                326.50992195725394
                              ],
                              [
                                2159.22319213621,
                                345.2686043289059
                              ],
                              [
                                2155.023487127631,
                                369.3469130447577
                              ],
                              [
                                2175.74203183662,
                                393.4252217606095
                              ],
                              [
                                2184.701402521588,
                                393.70520209451473
                              ]
                            ],
                            "strokeStyle": "rgba(208,2,27,1)",
                            "lineWidth": 3,
                            "controlPt": [
                              [
                                2196.936543113248,
                                402.58057867931126
                              ],
                              [
                                2226.110493906175,
                                384.0178825413931
                              ],
                              [
                                2232.8300219199014,
                                345.8845610634971
                              ],
                              [
                                2202.760134058477,
                                312.03493869435255
                              ],
                              [
                                2160.1471272380973,
                                321.2742897132254
                              ],
                              [
                                2142.6763544024093,
                                354.78793568168453
                              ],
                              [
                                2150.9357742526145,
                                393.8171942280767
                              ],
                              [
                                2180.053728978761,
                                398.940834338543
                              ]
                            ],
                            "editPt": null,
                            "bNeedHitByBbox": true,
                            "drawEnd": true,
                            "markupId": 1582524701084
                        }
                    ],
                    "state": {
						"ver": 1,
						"WorldScale": 0.0016835016835016834,
						"ViewAngle": 0,
						"ViewCenter": {
						  "x": 2120.1520452551376,
						  "y": 346.92476280523624
						},
						"ZoomFactor": 1
                    }
                  }
            }
        ]
    ]
]